# TfPerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..TfPerM Property
SymbolTypeId Class See Also
---
Symbol Tf/m, indicating unit Tonnes force per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId TfPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TfPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TfPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace